src/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеДиапазонаСерийныхНомеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСертификатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДиапазона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Постфикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Хранит наличии ошибок по заданным реквизитам.
&НаКлиенте
Перем ЕстьОшибкиПоКодам; // Булево значение - наличие ошибок по кодам.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Рассчитывает первый и последний код
//
Процедура РасчитатьКоды()
	
	КоличествоСимволовКода =СтрДлина(Объект.Префикс) + Объект.КоличествоСимволов + СтрДлина(Объект.Постфикс);
	ЕстьОшибкиПоКодам = Истина;
	Если КоличествоСимволовКода > 200 Тогда
		Объект.ПервыйКод    = "Количество символов превышает допустимое значение 200";
		Объект.ПоследнийКод = "Количество символов превышает допустимое значение 200";
	Иначе
		Если Объект.НачалоДиапазона > 0  Тогда
			Объект.ПервыйКод = Объект.Префикс + Формат(Объект.НачалоДиапазона, "ЧЦ=" + Строка(Объект.КоличествоСимволов) + "; ЧВН=; ЧГ=0")+ Объект.Постфикс;
		Иначе
			Объект.ПервыйКод = Объект.Префикс + ПолучитьПредставлениеНулевогоДиапазона() + Объект.Постфикс;
		КонецЕсли; 
		
		Если Объект.КоличествоСертификатов > 0 Тогда
			Если СтрДлина(Формат(Объект.КоличествоСертификатов, "ЧГ=0")) > Объект.КоличествоСимволов Тогда
				Объект.ПоследнийКод = "Код не может быть сформирован";
			Иначе
				Объект.ПоследнийКод = Объект.Префикс + Формат(Объект.НачалоДиапазона + Объект.КоличествоСертификатов - 1, "ЧЦ=" + Строка(Объект.КоличествоСимволов) + "; ЧВН=; ЧГ=0")+ Объект.Постфикс;
				ЕстьОшибкиПоКодам = Ложь;
			КонецЕсли;
		Иначе
			Объект.ПоследнийКод = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура КоличествоСертификатовПриИзменении(Элемент)
	
	РасчитатьКоды();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПрефиксПриИзменении(Элемент)
	
	РасчитатьКоды();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПостфиксПриИзменении(Элемент)
	
	РасчитатьКоды();
	
КонецПроцедуры

&НаКлиенте
// Нулевой диапазон
//
// Параметры
//  Нет
//
// Возвращаемое значение:
//   Строка состоящая из нулей
//
Функция ПолучитьПредставлениеНулевогоДиапазона()

	Диапазон = "";
	Для Индекс = 1 По Объект.КоличествоСимволов Цикл
		
		Диапазон = Диапазон + "0";
		
	КонецЦикла;
	
	Возврат Диапазон

КонецФункции // ПолучитьПредставлениеНулевогоДиапазона()

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура КоличествоСимволовПриИзменении(Элемент)
	
	РасчитатьКоды();
	
КонецПроцедуры

&НаКлиенте
// Проверяет возможность создания сертификатов
//
// Параметры
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьОбщуюВозможностьСозданияСертификатов()
	Если Объект.КоличествоСертификатов = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задайте количество сертификатов!");
		Возврат Ложь;
	КонецЕсли;
	
	ПроверкаПройдена = Истина;
	Если ЕстьОшибкиПоКодам Тогда
		ПроверкаПройдена = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет возможности создания сертификатов с кодами");
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаКлиенте
// Процедура создает сертификаты
//
// Параметры;
//  Нет
//
Процедура СформироватьСерийныеНомера(Команда)
	
  	Если Не ПроверитьОбщуюВозможностьСозданияСертификатов() Тогда
		Возврат;
	КонецЕсли;
	
	НашлиПересеченияКодов = Ложь;
	
	СтруктураТаблиц = Новый Структура;
	ТаблПеремен = Неопределено;
	ТаблицаСуществующихКодов = НайтиСуществующиеКоды();
	Если ТаблицаСуществующихКодов.Количество() > 0 Тогда
		НашлиПересеченияКодов = Истина;
		СтруктураТаблиц.Вставить("ТаблицаСуществующихКодов", ТаблицаСуществующихКодов);
	КонецЕсли;
	
	Если НашлиПересеченияКодов Тогда			
		ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьСерийныеНомераФрагмент", ЭтотОбъект, Новый Структура("НашлиПересеченияКодов, ТаблицаСуществующихКодов", НашлиПересеченияКодов, ТаблицаСуществующихКодов)), "В заданном диапазоне есть использованные ранее коды. Продолжить создание только уникальных серийных номеров?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	СформироватьСерийныеНомераЗавершение(НашлиПересеченияКодов, ТаблицаСуществующихКодов);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСерийныеНомераФрагмент(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	НашлиПересеченияКодов = ДополнительныеПараметры.НашлиПересеченияКодов;
	ТаблицаСуществующихКодов = ДополнительныеПараметры.ТаблицаСуществующихКодов;
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда			
		Возврат;
	КонецЕсли;
	
	СформироватьСерийныеНомераЗавершение(НашлиПересеченияКодов, ТаблицаСуществующихКодов);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьСерийныеНомераЗавершение(Знач НашлиПересеченияКодов, Знач ТаблицаСуществующихКодов)
	
	Создано = 0;
	
	Для Счетчик = 1 По Объект.КоличествоСертификатов Цикл
		
		Если (Объект.НачалоДиапазона + Счетчик -1) > 0  Тогда
			ТекушийКод = Объект.Префикс + Формат(Объект.НачалоДиапазона + Счетчик -1, "ЧЦ=" + Строка(Объект.КоличествоСимволов) + "; ЧВН=; ЧГ=0")+ Объект.Постфикс;
		Иначе
			ТекушийКод = Объект.Префикс + ПолучитьПредставлениеНулевогоДиапазона() + Объект.Постфикс;
		КонецЕсли;
		
		Если НашлиПересеченияКодов Тогда
			СтрокаТаблицы = ТаблицаСуществующихКодов.Найти(ТекушийКод);
			Если Не СтрокаТаблицы = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не создан серийный номер - " + ТекушийКод);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СоздатьСерийныеНомера(ТекушийКод, Создано); 
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серийные номера. Создано: "+Создано);

КонецПроцедуры

&НаСервере
// Процедура создает серийные номера сертификатов
//
Процедура СоздатьСерийныеНомера(ТекушийКод, Создано)
	
	НачатьТранзакцию();
	
	БылиОшибки = Ложь;
	СерийныйНомер = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
	СерийныйНомер.Владелец = Объект.Номенклатура;
	СерийныйНомер.Наименование = ТекушийКод;
	
	Попытка
		СерийныйНомер.Записать();
	Исключение
		БылиОшибки = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не смогли записать серийный номер - " + ТекушийКод + "  " + ОписаниеОшибки())
	КонецПопытки;
	
	Если БылиОшибки Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
		Создано = Создано + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Найти существующие коды.
//
Функция НайтиСуществующиеКоды()
	
	Запрос = Новый Запрос("ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	                      |	ПартииНоменклатуры.Наименование
	                      |ИЗ
	                      |	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	                      |ГДЕ
	                      |	ПартииНоменклатуры.Владелец = &Номенклатура
	                      |	И ПартииНоменклатуры.Наименование >= &ПервыйКод
	                      |	И ПартииНоменклатуры.Наименование <= &ПоследнийКод");
						  
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("ПервыйКод", Объект.ПервыйКод);
	Запрос.УстановитьПараметр("ПоследнийКод", Объект.ПоследнийКод);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
		
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура НачалоДиапазонаПриИзменении(Элемент)
	
	РасчитатьКоды();
	
КонецПроцедуры

#КонецОбласти
